In [1]:
import pandas as pd

In [8]:
DF1 = pd.DataFrame({'NOMBRE':['Jose','Max'],
                   'CARRERA':['Economia','Arquitectura'],'EDAD':[23,26]}).set_index('NOMBRE')

In [10]:
DF2 = pd.DataFrame({'NOMBRE':['Aurora','Maria'],
                    'CARRERA':['Medicina','Informatica'],'EDAD':[22,28]}).set_index('NOMBRE')

In [12]:
DF = pd.concat([DF1,DF2])

In [14]:
DF1

             CARRERA  EDAD
NOMBRE
Jose        Economia    23
Max     Arquitectura    26

In [16]:
DF2

            CARRERA  EDAD
NOMBRE
Aurora     Medicina    22
Maria   Informatica    28

In [18]:
DF

             CARRERA  EDAD
NOMBRE
Jose        Economia    23
Max     Arquitectura    26
Aurora      Medicina    22
Maria    Informatica    28